simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
/* Excursion medida del tap de la etapa 0, en uV: 1114,4 - 759,4 mV. */
#ifndef CAL_STAGE0_EXCURSION_UV
#define CAL_STAGE0_EXCURSION_UV 355000L
#endif
/* Pendiente del IDAC de la etapa 0 sobre su tap a PGA x1, en uV por codigo. */
#ifndef CAL_STAGE0_UV_POR_CODIGO_X1
#define CAL_STAGE0_UV_POR_CODIGO_X1 62L
#endif

static int16 cal_stage0_max_change(void)
{
    int32 pga_x1000 = (int32)psoc_hw_pga_gain_x1000();
    int32 utiles;

    if (pga_x1000 <= 0L) {
        return (int16)PSOC_IDAC_SIGNED_MAX;
    }
    /* (excursion / 2) / (uV_por_codigo * ganancia), con el 20 % de margen.
     * Todo en int64 para que no desborde con ganancias chicas. */
    utiles = (int32)(((int64)CAL_STAGE0_EXCURSION_UV * 1000LL * 4LL) /
                     ((int64)CAL_STAGE0_UV_POR_CODIGO_X1 * (int64)pga_x1000 * 2LL * 5LL));
    if (utiles > (int32)PSOC_IDAC_SIGNED_MAX) {
        utiles = (int32)PSOC_IDAC_SIGNED_MAX;
    }
    /* Nunca menos de 24 codigos: por debajo de eso la etapa no podria corregir
     * ni su propio offset y el lazo abortaria por una cota que puso el firmware,
     * que es peor que abortar por el hardware. A x50 la cuenta da 105, asi que
     * este piso no se activa en ningun caso real; esta como red. */
    if (utiles < 24L) {
        utiles = 24L;
    }
    return (int16)utiles;
}

/* Cuanto puede moverse esta etapa respecto de su centro. Para la etapa 0 sale
 * de la cuenta de arriba; para las demas, de su tabla. */
static int16 cal_stage_max_change(const PsocCalStage *stage)
{
    if (stage->adc_channel == 0u) {
        int16 medido = cal_stage0_max_change();
        return (medido < stage->dac_max_change) ? medido : stage->dac_max_change;
    }
    return stage->dac_max_change;
}

static int16 cal_stage_min_dac(const PsocCalStage *stage)
{
    int32 lo = (int32)stage->dac_center - (int32)stage->dac_max_change;

    if (lo < -(int32)PSOC_IDAC_SIGNED_MAX) {
        lo = -(int32)PSOC_IDAC_SIGNED_MAX;
    }
    return (int16)lo;
}

static int16 cal_stage_max_dac(const PsocCalStage *stage)
{
    int32 hi = (int32)stage->dac_center + (int32)cal_stage_max_change(stage);

    if (hi > (int32)PSOC_IDAC_SIGNED_MAX) {
        hi = (int32)PSOC_IDAC_SIGNED_MAX;
    }
    return (int16)hi;
}

static int16 cal_stage_clamp_dac(const PsocCalStage *stage, int16 dac)
{
    int16 lo = cal_stage_min_dac(stage);
    int16 hi = cal_stage_max_dac(stage);

    if (dac < lo) { return lo; }
    if (dac > hi) { return hi; }
    return dac;
}

static int16 cal_stage_center_dac(const PsocCalStage *stage)
{
    return cal_stage_clamp_dac(stage, stage->dac_center);
}

PsocCalResult g_psoc_cal_results[PSOC_CAL_MAX_STAGES];
uint8 g_psoc_cal_result_count = 0u;

#define CAL_ASYNC_EMPTY_POLL_LIMIT 2000000UL

/* Watchdog global expresado como ticks legacy de 10 ms para mantener la escala
 * de configuracion anterior; en runtime lo ejecuta Timer_3 como one-shot.
 *
 * 90.000 ticks son 900 s. Estaba en 400 s, y con las esperas correctas eso ya
 * no alcanza: una calibracion honesta de esta cadena son dos etapas por
 * (2 tau de entrada + hasta 5 pasos de 1 tau) = 412 s nominales. El watchdog
 * tiene que atajar una calibracion COLGADA, no una que esta esperando lo que
 * la fisica pide. Con tau = 30 s no hay forma de calibrar esto en menos de
 * varios minutos, y eso es un resultado, no un defecto. */
#ifndef CAL_WATCHDOG_TICKS
#define CAL_WATCHDOG_TICKS 150000UL
#endif

/* Periodo de telemetria de progreso (ticks legacy de 10 ms => ~500 ms). */
#define CAL_PROGRESS_PERIOD_TICKS 50UL
#define CAL_LEGACY_TICK_MS 10UL
#define CAL_WATCHDOG_MS (CAL_WATCHDOG_TICKS * CAL_LEGACY_TICK_MS)
#define CAL_PROGRESS_PERIOD_MS (CAL_PROGRESS_PERIOD_TICKS * CAL_LEGACY_TICK_MS)

/* Muestras del PI que se envian al ESP durante calibracion. No puede ser cada
 * muestra a 3 kHz: cada valor int32 viaja como 4 eventos UART. */
#ifndef CAL_PI_TELEM_PERIOD
#define CAL_PI_TELEM_PERIOD 256u
#endif

#ifndef CAL_PI_HAMMER_PASS_COUNT
#define CAL_PI_HAMMER_PASS_COUNT 1u
#endif

#if PSOC_HW_CLASS == PSOC_HW_HAMMER
#define CAL_PI_PASS_COUNT CAL_PI_HAMMER_PASS_COUNT
#else
/* DOS PASADAS EN GEO, Y NO POR PRUDENCIA: la secuencia que hace falta es
 * LP, ADDER, LP, y con una sola pasada sobre dos etapas no se puede escribir.
 *
 * Medido el 2026-09-05 con el canal de diagnostico, arrancando con la cadena
 * contra el riel de abajo:
 *
 *   42 pasos del ADDER movieron su PROPIO tap 1,5 V y el tap del LP CERO.
 *   La medida de ch3 quedo en 39.182..39.199 cuentas, que es ruido.
 *   El primer movimiento del LP lo saco de ahi de un salto, +153 mV de banco.
 *
 * O sea: cuando el LP esta saturado, el ADDER NO PUEDE RESCATARLO. La
 * saturacion del propio LP corta el camino, y lo unico que lo mueve es su
 * propia referencia, que actua adentro de la etapa. Recien con el LP fuera de
 * saturacion el ADDER recupera la autoridad que la matriz de acople le midio.
 *
 * Esto CORRIGE la conclusion del 2026-09-05 -"el LP no se centra con su propio
 * IDAC sino desde el ADDER"-, que se saco midiendo en un punto donde el LP NO
 * estaba saturado. Sigue siendo cierta ahi; no lo es cuando hay que rescatarlo.
 *
 * Con la tabla en orden LP, ADDER, dos pasadas dan:
 *   LP     rescate: sacarlo de saturacion con su propia referencia
 *   ADDER  grueso : recorrer la excursion, que es donde tiene autoridad
 *   LP     fino   : los ultimos milivoltios, donde su resolucion de 525 uV por
 *                   codigo sirve y los 3823 del ADDER no alcanzarian
 *   ADDER  ajuste : lo que sobre
 */
#define CAL_PI_PASS_COUNT 2u
#endif

#ifndef CAL_DIAG_SWEEP_ENABLE
#define CAL_DIAG_SWEEP_ENABLE 0u
#endif

#ifndef CAL_DIAG_SWEEP_SETTLE_MS
#define CAL_DIAG_SWEEP_SETTLE_MS 30u
#endif

typedef enum {
    CAL_ASYNC_IDLE = 0u,
    CAL_ASYNC_DONE
} PsocCalAsyncState;

typedef struct {
    PsocCalAsyncState state;
    uint8 busy;
    uint8 done;
    uint8 ok;
    uint8 stage_index;
    uint8 pass_index;
} PsocCalAsync;

static PsocCalAsync g_cal_async = { CAL_ASYNC_IDLE };




/* Primera etapa desde `desde` que efectivamente se calibra, o PSOC_CAL_STAGE_COUNT
 * si no queda ninguna. Las que estan fuera de la secuencia existen para el
 * instrumento -que necesita escribir sus IDAC- pero el lazo no las recorre. */
static uint8 cal_siguiente_etapa(uint8 desde)
{
    uint8 i;

    for (i = desde; i < PSOC_CAL_STAGE_COUNT; i++) {
        if (g_psoc_cal_stages[i].en_secuencia) {
            return i;
        }
    }
    return PSOC_CAL_STAGE_COUNT;
}

static int16 cal_stage_current_dac(uint8 stage_index)
{
    if (stage_index >= g_psoc_cal_result_count) {
        return cal_stage_center_dac(&g_psoc_cal_stages[stage_index]);
    }
    return cal_stage_clamp_dac(&g_psoc_cal_stages[stage_index],
                               g_psoc_cal_results[stage_index].final_dac);
}

