simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
/* Ganancia fisica de la etapa, referencia -> tap, x1000.
 *
 * La etapa 0 es la unica que NO tiene ganancia fija: su tap es la salida del
 * PGA de entrada, asi que lo que la referencia mueve alla escala con la
 * ganancia que tenga puesto el PGA. Medido en la placa: 57,7 / 108,7 / 220,2 /
 * 448,7 uV por codigo para 1x / 2x / 4x / 8x, o sea proporcional. Sin esto el
 * PI usaba la ganancia de 1x para todas y a 8x pedia un esfuerzo ocho veces
 * mayor que el necesario.
 *
 * Que la etapa 0 tenga la ganancia mas chica es justamente lo que la hace
 * calibrable con precision: 57,7 uV por codigo es el paso mas fino de las
 * cuatro etapas. */
/* --------------------------------------------------------------------------
 * TAU DE LA PLANTA EN TIEMPO DE EJECUCION
 *
 * Estos dos son variables y no constantes por una razon medida, no por gusto:
 * tau depende de la temperatura -C1 es un electrolitico- y en la ubicacion del
 * nodo la temperatura va de 8 a 32 C en la misma semana. Una constante de banco
 * tomada a 19 C no cubre eso.
 *
 * La decision de Elias fue NO corregir por temperatura sino MEDIR tau en el
 * propio nodo y dimensionar la espera con lo medido. Estas variables son el
 * lugar donde aterriza esa medicion.
 *
 * Son uint16 por pedido explicito, y por eso tau esta en ms y no en muestras.
 * -------------------------------------------------------------------------- */
static uint16 g_cal_tau_ms          = CAL_PI_TAU_MS;
static uint16 g_cal_plant_tau_x10   = CAL_PI_PLANT_SETTLE_TAU_X10;
/* Espera despues de cada paso del lazo, en decimas de tau. 10 = 1 tau. Ver el
 * bloque largo en psoc_cal_step_settle_samples(). */
static uint16 g_cal_step_tau_x10    = CAL_PI_STEP_SETTLE_TAU_X10;

/* POR QUE NO HAY UNA ESPERA POR ETAPA. Habia un campo plant_settle_samples por
 * etapa, y sobra: la matriz de acople del 2026-09-04 midio tau en los SEIS
 * pares (etapa, tap) con senal util y dio 26,4 a 33,4 s, media 29,5. Es UN SOLO
 * polo -C1 contra R4- visto desde distintos lugares, no uno por etapa. Cuatro
 * constantes para un solo polo son cuatro oportunidades de que se
 * desincronicen. */
uint32 psoc_cal_plant_settle_samples(void)
{
    uint32 tau_muestras = CAL_PI_TAU_SAMPLES_FROM_MS(g_cal_tau_ms);
    /* Dividir antes de multiplicar: asi sigue entrando en uint32 aunque alguien
     * pida 10 tau. */
    return (tau_muestras / 10UL) * (uint32)g_cal_plant_tau_x10;
}

/* ==========================================================================
 * LA ESPERA DESPUES DE CADA PASO, que no es la misma que la de entrada
 *
 * psoc_cal_plant_settle_samples() se paga UNA vez al entrar a la etapa: espera
 * a que se asiente lo que dejo la etapa anterior. Esta se paga despues de CADA
 * movimiento del DAC, y sin ella el lazo no puede funcionar: mueve la
 * referencia, vuelve a medir 30 ms despues -cuando la cadena todavia no
 * reacciono, porque tarda tau- y concluye que no paso nada. Entonces vuelve a
 * mover. Es un integrador cargando contra una planta que todavia no contesto, y
 * termina siempre igual: en el riel.
 *
 * Medido el 2026-09-05 con el canal de diagnostico: en toda una etapa la medida
 * paso de 39.191 a 39.190 cuentas mientras el lazo movia la referencia. No es
 * que corrigiera mal; es que estaba mirando el pasado.
 *
 * Lo que habia era `control_hold_remaining = 0` con este comentario: "la
 * siguiente lectura directa ya integra 30 ms de conversiones". Es cierto y es
 * irrelevante: 30 ms es lo que tarda el DECIMADOR DEL ADC, no la cadena. Es el
 * mismo error de razonamiento que dejo la espera de planta en una rama muerta,
 * y es la tercera vez que aparece: en todos lados donde entro el lector directo
 * se sustituyo el tiempo de la planta por el del ADC.
 *
 * Un tau por paso deja el 37 % del transitorio sin ver, y eso esta bien: el
 * paso siguiente lo mide y lo corrige, que es justamente lo que hace un lazo.
 * Lo que no se puede es no esperar nada. Es tambien lo que hace el
 * procedimiento desde la PC, que si converge: 30 s de espera por paso grueso y
 * 59 s por paso fino.
 * ========================================================================== */
uint32 psoc_cal_step_settle_samples(void)
{
    uint32 tau_muestras = CAL_PI_TAU_SAMPLES_FROM_MS(g_cal_tau_ms);
    return (tau_muestras / 10UL) * (uint32)g_cal_step_tau_x10;
}

uint16 psoc_cal_get_step_tau_x10(void)
{
    return g_cal_step_tau_x10;
}

/* Mismo criterio que el multiplicador de planta: se rechaza lo absurdo en vez
 * de aceptarlo y quedarse esperando un tiempo ridiculo. */
uint8 psoc_cal_set_step_tau_x10(uint16 x10)
{
    if (x10 > 100u) {
        return 0u;
    }
    g_cal_step_tau_x10 = x10;
    return 1u;
}

uint16 psoc_cal_get_tau_ms(void)
{
    return g_cal_tau_ms;
}

/* Devuelve 0 si el valor pedido es absurdo, para que un tau mal medido no pueda
 * dejar la calibracion esperando un tiempo ridiculo. Los limites son anchos a
 * proposito: 1 s a 60 s cubre el rango de temperatura de campo con margen
 * grande, y lo que se quiere atajar es un error de medicion, no afinar. */
uint8 psoc_cal_set_tau_ms(uint16 tau_ms)
{
    if (tau_ms < 1000u || tau_ms > 60000u) {
        return 0u;
    }
    g_cal_tau_ms = tau_ms;
    return 1u;
}

uint16 psoc_cal_get_plant_tau_x10(void)
{
    return g_cal_plant_tau_x10;
}

/* 0 = sin espera de planta (comportamiento viejo, util para comparar).
 * El techo de 100 son 10 tau, muy por encima de los 2 tau que fijo Elias. */
uint8 psoc_cal_set_plant_tau_x10(uint16 x10)
{
    if (x10 > 100u) {
        return 0u;
    }
    g_cal_plant_tau_x10 = x10;
    return 1u;
}

static int32 cal_pi_stage_gain_x1000(uint8 stage_index)
{
    int32 configured_gain = g_cal_pi_cfg[stage_index].gain_x1000;

    if (stage_index == 0u && configured_gain > 0L) {
        int32 pga_gain_x1000 = (int32)psoc_hw_pga_gain_x1000();
        if (pga_gain_x1000 > 0L) {
            return cal_round_div_i64((int64)configured_gain * (int64)pga_gain_x1000,
                                     1000LL);
        }
    }
    return configured_gain;
}

static int32 cal_pi_deadband_counts(uint8 stage_index)
{
#ifdef CAL_PI_FORCE_MIN_DEADBAND
    (void)stage_index;
    return CAL_PI_DEADBAND_MIN_COUNTS;
#else
    int32 deadband = g_cal_pi_cfg[stage_index].deadband_counts;

