simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
#if PSOC_HW_CLASS == PSOC_HW_GEO
    if (stage_index == 0u) {
        uint16 gain_x1000 = psoc_hw_pga_gain_x1000();
        if (gain_x1000 >= 6000u) {
            deadband = CAL_PI_DEADBAND_GEO_PGA_8X_COUNTS;
        } else if (gain_x1000 >= 3000u) {
            deadband = CAL_PI_DEADBAND_GEO_PGA_4X_COUNTS;
        } else if (gain_x1000 >= 1500u) {
            deadband = CAL_PI_DEADBAND_GEO_PGA_2X_COUNTS;
        } else {
            deadband = CAL_PI_DEADBAND_GEO_PGA_1X_COUNTS;
        }
    }
#endif
    if (deadband < CAL_PI_DEADBAND_MIN_COUNTS) {
        deadband = CAL_PI_DEADBAND_MIN_COUNTS;
    }
    return deadband;
#endif
}

static int32 cal_pi_error_bucket(int32 error_counts, int32 deadband_counts)
{
    int32 abs_error;
    int32 span;
    int32 bucket;

    span = (deadband_counts <= 0L) ? 1L : deadband_counts;
    abs_error = abs_counts(error_counts);
    if (abs_error <= span) {
        return 0L;
    }
    bucket = 1L + ((abs_error - span - 1L) / span);
    return (error_counts < 0L) ? -bucket : bucket;
}

static uint8 cal_pi_measurement_valid(int32 measured)
{
    return (measured >= CAL_ADC_SIGNED_MIN_COUNTS &&
            measured <= CAL_ADC_SIGNED_MAX_COUNTS) ? 1u : 0u;
}

/* ==========================================================================
 * MEDIDA CREIBLE vs MEDIDA VALIDA
 *
 * cal_pi_measurement_valid() de arriba solo pregunta si el numero entra en el
 * rango del ADC, y por eso nunca dice que no: 39.190 cuentas de 131.072 entran
 * comodas. Pero esas 39.190 cuentas equivalen a -2,6 V contra masa, que es
 * imposible, y se mantuvieron clavadas mientras el lazo movia la referencia 42
 * veces. Fuera de la ventana observable el ADC devuelve algo que NO DEPENDE DEL
 * TAP, y un lazo cerrado sobre eso no puede converger: empuja contra un numero
 * fijo hasta el riel.
 *
 * Esta es la pregunta que hacia falta y no existia.
 * ========================================================================== */
static uint8 cal_medida_en_ventana(int32 measured)
{
    return (measured >= (CAL_VENTANA_MIN_COUNTS + CAL_VENTANA_MARGEN_COUNTS) &&
            measured <= (CAL_VENTANA_MAX_COUNTS - CAL_VENTANA_MARGEN_COUNTS))
           ? 1u : 0u;
}

/* Salto del rescate en lazo abierto, en codigos. Se deriva del recorrido que la
 * propia etapa declara, asi que escala sola: un octavo del recorrido da ocho
 * intentos antes de agotar el actuador, que es un compromiso razonable entre
 * tardar y pasarse de largo. Nunca menos de uno. */
static int16 cal_paso_rescate(const PsocCalStage *stage)
{
    int16 paso = (int16)(cal_stage_max_change(stage) / 8);
    return (paso < 1) ? (int16)1 : paso;
}

static uint8 cal_stage_measure_current(uint8 stage_index, int16 dac, int32 *measured)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[stage_index];

    ADC_Stop();
    CAL_AMUX_ADC_SELECT(stage->adc_channel);
    ADC_Start();
    stage->write(dac);
    CyDelay(CAL_DIAG_SWEEP_SETTLE_MS);
    if (measured != (int32 *)0) {
        *measured = cal_adc_read_direct_counts();
    }
    return 1u;
}

static uint8 cal_stage_value_in_tolerance(uint8 stage_index, int32 measured)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[stage_index];
    int32 control_sample = cal_pi_compare_counts(measured);
    int32 error_counts = stage->target_counts - control_sample;
    int32 deadband_counts = cal_pi_deadband_counts(stage_index);

    return (abs_counts(error_counts) <= deadband_counts &&
            cal_pi_measurement_valid(measured)) ? 1u : 0u;
}

static uint8 cal_verify_seeded_values(void)
{
    uint8 i;
    uint8 all_ok = 1u;

    cal_diag(PSOC_EVT_BOOT, PSOC_HW_CLASS);
    g_psoc_cal_result_count = PSOC_CAL_STAGE_COUNT;

    for (i = 0u; i < PSOC_CAL_STAGE_COUNT; i++) {
        const PsocCalStage *stage = &g_psoc_cal_stages[i];
        PsocCalResult *result = &g_psoc_cal_results[i];
        int16 dac = cal_stage_current_dac(i);
        int32 measured = 0L;
        uint8 ok;

        /* Sin este salto el precheck nunca daria por buena la cadena: juzgaria
         * al PGA contra su objetivo nominal, que a x50 no se cumple ni se
         * pretende cumplir, y obligaria a recalibrar siempre. */
        if (!stage->en_secuencia) {
            result->final_dac = dac;
            result->final_measured = 0L;
            result->ok = 1u;
            continue;
        }

        cal_diag(PSOC_EVT_CAL_STAGE_BEGIN, i);
        cal_diag_i32(PSOC_EVT_CAL_STAGE_TARGET32, stage->target_counts);

        (void)cal_stage_measure_current(i, dac, &measured);
        ok = cal_stage_value_in_tolerance(i, measured);

        result->final_dac = dac;
        result->final_measured = measured;
        result->ok = ok;

        cal_diag(PSOC_EVT_CAL_STAGE_DAC, result->final_dac);
        cal_diag_i16(PSOC_EVT_CAL_STAGE_MEAS, result->final_measured);
        cal_diag_i32(PSOC_EVT_CAL_STAGE_MEAS32, result->final_measured);
        cal_diag(PSOC_EVT_CAL_STAGE_OK, result->ok);

        if (!ok) {
            all_ok = 0u;
        }
    }

    psoc_calibration_restore_capture_path();
    return all_ok;
}

static int32 cal_pi_abs_error_counts(const PsocCalStage *stage, int32 measured)
{
    int32 control_sample = cal_pi_compare_counts(measured);
    return abs_counts(stage->target_counts - control_sample);
}

static int32 cal_pi_gain_scaled_term(int32 value, int32 num, int32 div, int32 gain_x1000)
{
    int32 sign = 1L;

    if (div == 0L) {
        div = 1L;
    }
    if (gain_x1000 < 0L) {
        sign = -1L;
        gain_x1000 = -gain_x1000;
    }
    if (gain_x1000 == 0L) {
        gain_x1000 = 1000L;
    }
    /* value permanece en counts hasta esta division. La version anterior lo
     * redondeaba primero a un codigo IDAC entero y recien despues dividia por
     * la ganancia: en GEO_PGA eso descartaba correcciones reales de varios
     * LSB del actuador. Esta expresion encadena counts->uV->IDAC->etapa en un
     * unico cociente int64 y conserva toda la resolucion. */
    return sign * cal_round_div_i64(
        (int64)value * (int64)num * (int64)CAL_ADC_SPAN_UV * 1000LL,
        (int64)div * (int64)CAL_ADC_LEVELS *
        (int64)CAL_IDAC_UV_PER_LSB * (int64)gain_x1000);
}

